In [1]:
import pandas as pd

In [3]:
friends = [
    {'name': 'Jone', 'age': 20, 'job': 'student'},
    {'name': 'Jenny', 'age': 30, 'job': None},
    {'name': 'Nate', 'age': 30, 'job': 'teacher'}
]
df = pd.DataFrame(friends)
df = df[['name', 'age', 'job']]

In [4]:
df.head()

    name  age      job
0   Jone   20  student
1  Jenny   30     None
2   Nate   30  teacher

In [9]:
df.to_csv('data/friends.csv', index=False, header=False, na_rep = '-')